[{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "No fucking way so did I "}], "body": "I tiredly read \"potatoshop skills\""}], "body": "sweet photoshop skills lad"}, {"replies": [], "body": "In my bathtub"}], "body": "http://imgur.com/M18449c"}, {"replies": [{"replies": [], "body": "Not another night talking about the shit winds, Mr. Lahey, PLEASE!"}, {"replies": [], "body": "[Shitstorm](http://i.imgur.com/4Z0viwi.jpg)"}], "body": "*You smell that? The shitwinds are a-blowin ....*"}], "body": "You've opened the shitpost gates"}, {"replies": [{"replies": [], "body": "quality shitpost"}], "body": "Wew lad that is some👌🎩👓🎩👍🎩👓🎩👍🎩 euphoric logic !euphoric loGic👌 thats ✔ some euphoric👌💻 logic right👌💻there👌👍👌 Carl 🔭 Sagan🌌💫if i do ƽaү so gentlemen 💯 i say so 💯 thats euPhoric logic right there Richard 📒 Dawkins🎩 (chorus: ^^socrates ^^died ^^for ^^this ^^shit ) mMMMMᎷМ💯 👌👓👌НO0ОଠOOOOOОଠଠOoooᵒᵒᵒᵒᵒᵒᵒᵒᵒ👌 👌🎩 👌 💯 👌 👓🎩🎩🎩 👍👌euphoric logic\n\n  "}], "body": "Wew lad"}, {"replies": [{"replies": [{"replies": [], "body": "Yeah, but as long as he doesn't know he is then it's alright"}], "body": "But he clearly is."}], "body": "For me it was \"oh ok good he doesn't actually believe he's hot shit or something\""}, {"replies": [{"replies": [], "body": "Answer: Reddit has Aspergers, and its special interest is diagnosing Autism\n\nSource: I am a redditor"}], "body": "What's reddit's obsession with diagnosing people as autistic?"}, {"replies": [], "body": "http://i.imgur.com/W84b1Yc.gif"}], "body": "It's more like \"ah, he doesn't have autism, whew\"."}], "body": "yeah, you're like, ah, he's just fucking about, he's in on the joke"}, {"replies": [{"replies": [{"replies": [], "body": "Funnier for sure. "}, {"replies": [{"replies": [{"replies": [], "body": "Me too. BULLSHIT is one if my all time favorite shows. "}], "body": "I like hearing Penn talk politics.\n\n    #memberofthecongregation"}], "body": "As long as Penn doesn't talk politics too long, yes. "}, {"replies": [], "body": "Yes."}, {"replies": [], "body": "Are you implying he's not?"}], "body": "Are you implying that Penn is less cringey than Copperfield?"}], "body": "Completely. Takes him from David Copperfield to Penn Jillette instantaneously. "}, {"replies": [{"replies": [], "body": "Aww."}], "body": "Your smile saves me :)"}, {"replies": [], "body": "I went from \"There really seems to be a type that does this sort of thing\" to \"Oh, okay, he seems pretty normal.\""}], "body": "The smile saves it."}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "And scene!"}], "body": "Cards tossed again."}], "body": "Cards caught"}, {"replies": [{"replies": [], "body": "Mom's spaghetti."}], "body": "Mom angry."}], "body": "Cards tossed."}, {"replies": [], "body": "Ive never passed out so many upvotes in a row."}], "body": "Shots Fired."}, {"replies": [], "body": "TIL nerds like it doggy style."}], "body": "Great! I hear nerds love golden retrievers"}, {"replies": [{"replies": [], "body": "I think OP can give himself a handjob."}], "body": "Bro get out of the way. I want this stallion's dick in my girlfriend stat."}, {"replies": [], "body": "You can fuck me too"}], "body": "dude you can fuck my bitch any time you want"}, {"replies": [{"replies": [{"replies": [{"replies": [], "body": "←↓ ←↓ ←↓ ←↓ ←↓ "}, {"replies": [], "body": "Wow!"}], "body": "What a Save! What a Save!"}], "body": "^^^fuck ^^^fuck ^^^fuck Well I'm not theMattgican't\n\n\n\n^^^^nailed ^^^^it"}, {"replies": [], "body": "good point Cunt_Nectar"}], "body": "But shouldn't it be 'Mattgician'?"}, {"replies": [{"replies": [], "body": "Matt card skills bro\n"}], "body": "I personally love the username. Mad card skills bro!"}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "This one is my favorite.\n\nBy Ruud Lubbers on May 22, 2014\n\nI don't know who's idea this was, but I don't think they thought it through very well.\n\nI ordered one of these for my cat, Mr. Razzles, and it took me forever to get it on his head - I don't know what the makers were thinking, but it's waaaay too big for the average housecat.\n\nFinally - after quite a struggle - I got it on and proceeded to throw Mr. Razzles into the pool. Well he absolutely FREAKED OUT! He thrashed around in the water for a minute or so before wriggling out of the pussy snorkel and then swam right for the side of the pool and climbed out before I could even get in the water with him to enjoy a nice swim.\n\nWhen I tried to put it back on him, he started hissing and biting and bolted out of the backyard back into the house, where he hid under the credenza for THREE DAYS before my husband finally lured him out with some tuna...\n\nHe's been traumatized and distrustful ever since! I don't recommend this for cat owners or pet lovers - it's just a bad idea all around!"}], "body": "**REVIEW:** ** / ***** -- **DOESN'T WORK**\n\n*I'm still drowning in pussy.*"}], "body": "[Ah yes the famous pussy snorkel.](http://www.amazon.com/Glow-N-Dark-Pussy-Snorkel/dp/B001D26Q16/ref=cm_cr_pr_product_top?ie=UTF8)"}, {"replies": [], "body": "I fucking love this dude."}, {"replies": [], "body": "**Illusion, Michael!** A trick is something a whore does for money....\n\n*or candy!*"}], "body": "The trick is to keep a snorkel handy at all times"}], "body": "How do you find time to practice card tricks when you're drowning in pussy?"}, {"replies": [{"replies": [], "body": "OP that's a solid offer "}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "All Aboard."}], "body": "Choo Choo"}], "body": "Same"}], "body": "Typically I would have ignored the previous comment. But I ended up creeping because of you.."}], "body": "Just creeped her profile and she's fucking hot so you had better PM her your number or your dick will rot off and an angry weasel will grow in its place.  That weasel will eat your balls and burrow into your intestine via your asshole.  \n\nIs all I'm sayin.\n\n"}], "body": "Date me"}, {"replies": [{"replies": [], "body": "She wants the D. Or the F.  \n\nThe finger that is."}], "body": "You're pretty damn good with your fingers ;)"}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "that's a cool fucking name uo need to own that shit."}], "body": "hey man."}], "body": "I would also like to add that i also noticed your username."}], "body": "I just watched all your videos, and enjoyed them immensely."}], "body": "hey man."}, {"replies": [], "body": "This reads like the first note of a future stalker. "}], "body": "This reads like an answering machine message"}, {"replies": [], "body": "I feel like you were fucking wasted when you wrote this. I love it."}], "body": "hey man. i just watched all your videos, and enjoyed them immensely. \nI would also like to add that i also noticed your username. hey man. that's a cool fucking name uo need to own that shit. well iif that was the name you were born with. anyways i love you bro and i am going to subscribe on youtube as soon as i can remember the right email for my youtube account. \n\n"}, {"replies": [], "body": "This guy fucks!"}], "body": "I made it to the front page. Huh.  \n[Well I can't think of a better time to shamelessly plug.](https://youtu.be/1Q5xmWbWamk)\n\nAnd yes, that's a shitty username. Get over it. \n\nEdit: Changed link to a video rather than my channel for you fine lazy people."}, {"replies": [{"replies": [{"replies": [{"replies": [], "body": "Man, Rocky's son always got on my fucking nerves in those movies. "}], "body": "So I am asking you for me, NOT to go through with this okay. This is only going to end up badly for you, and this is only going to end up badly for me."}], "body": "Damnit. I thought this year was going to definitely be my year, AND THIS HAPPENS?!"}], "body": "Alright, try to leave some pussy for the rest of us, will ya?"}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "/r/theydidthemath \n\n*he to they"}], "body": "[Checks out.](https://i.imgur.com/JHm6uoz.png)"}], "body": "FUCK IT I GIVE UP THIS IS GOING NOWHERE FFS!!!!!!!!!!!!!!!!!!!"}], "body": "So 5 minutes before you give up? "}], "body": "This subreddit is going to swallow so much time..."}], "body": "/r/cardistry"}], "body": "How would you start training yourself to do that? I can only picture my self throwing the pack into the air and watching it fall like confeti "}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "Sounds about right, also include eyepatches."}], "body": "Stitches and a short stay in the local ER?"}, {"replies": [{"replies": [], "body": "Pullin' tricks\n\n*Magic tricks*\n\nSo I can disappear \n\nthis dick\n\nInto this chick\n\n"}], "body": "In my experience, it led to getting laid (once) and getting free beers (several times)... Magic is intriguing to people, especially people who are looking to be entertained. "}], "body": "They may be better, but they probably all end with the same result."}, {"replies": [{"replies": [{"replies": [], "body": "I'm sure understanding the magic behind how magnets work is what made him all of that money."}], "body": "And that reason is that he has tons of money."}, {"replies": [{"replies": [{"replies": [], "body": "Ah, the good old days."}], "body": "\"What they actually look like:\"\nhttps://www.youtube.com/watch?v=qsEZ2lpM0Yw\n\nFTFY"}, {"replies": [{"replies": [], "body": "and being bruce lee"}], "body": "The important part is the oil."}], "body": "What one thinks they look like using nunchucks http://nunchaku-sfw.com/images/imgs/bruce_05.jpg vs what they actually look like https://i.ytimg.com/vi/kFvDBW3m40c/hqdefault.jpg"}], "body": "Can confirm: butterfly knives and nunchucks were my go-to and I took down zero pussy for it.\n\nThere's a reason David Copperfield gets so much first class ass.  "}, {"replies": [], "body": "\"I don't even have any good skills. You know like nunchuck skills, bow hunting skills, computer hacking skills. Girls only want boyfriends who have great skills!\""}, {"replies": [], "body": "You know what doesn't work?  Ventriloquist acts with puppets.  Boy, did THAT party go wrong."}, {"replies": [], "body": "I know a magician and he once said \"You won't get girls with card tricks. You'll get them with card magic.\""}, {"replies": [], "body": "I used to get pretty close to the kids (about 13-14) I used to coach. I came in one day and I saw a huge group of girl gathered around this one guy, a little bigger but not really fat, as he was performing probably some of the most impressive magic tricks I'd ever seen. These girls were hanging on everything he did and I had to admit I was a little jealous, thinking I could never be that confident.\n\nThen later in the season he confided in me that he had problems talking to girls. I couldn't understand it all."}], "body": "As adolescent mating behavior goes card tricks are better than butterfly knives or nunchucks I guess."}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "Step 1:  Turn off your brain\n\nStep 2:  Parrot le references to scifi and fantasy movies ad nauseam\n\nStep 3:  Snort"}, {"replies": [], "body": "My fucking engineering classes are obsessed with this talk. I saw it 3 times last semester."}], "body": "Talk nerdy to me"}], "body": "True.  I  didn't think it through before replying. \n\n"}], "body": "I think it's both."}, {"replies": [{"replies": [{"replies": [], "body": "Yeah, I think the original shirt design was something [like this](https://www.getdigital.de/web/getdigital/gfx/products/__generated__resized/238x238/Resistance_is_futile.jpg), which actually made sense and is a little bit funny. "}], "body": "Nah man, I'm with you there, looks like an \"I know science\" shirt, but there's no real joke around the electrical part. "}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "let's bash him real good."}, {"replies": [], "body": "<1ohm is futile!"}], "body": "I'm with shirtythebear, let's bash him good."}], "body": "I think we should bash him."}], "body": "Not at all, there's seriously no joke to be made. I'm with the pedant on this one. The problem is everyone brushing it off as just at shirt joke, so it's allowed to make no sense. I think it looks like a shirt he thought would make him look smart, and I'm not sure why it's being so heavily defended. I'm not saying we should bash the kid, but it shouldn't be encouraged, it's a tshirt neckbeard. \nThere, now its been taken too seriously. "}], "body": "Consider that you are taking a tshirt joke a bit too seriously."}], "body": "It's still not futile though. Sub-ohm resistors are often used for references in high current applications.\n\nTry measuring a thousand amps with a multimeter. You're going to need a heavy gauge wire to act as like a 0.001ohm resistor then measure the voltage across it to determine the current."}], "body": "No it's just that if you have less than 1 ohm you have very little or no resistance."}, {"replies": [], "body": "[This](http://maniacalindustries.com/images/stories/virtuemart/product/resistance-is-futile.gif) joke makes much more sense as a \"joke\"."}, {"replies": [], "body": "Resistance is Futile is a saying the Borg used a lot on Star Trek TNG.  So its like a star trek reference with a bonus joke related to electricity.  Like someone else said, its just a funny shirt."}], "body": "Can someone explain this joke? I've had two years of electrical engineering education in college, and I'm not getting it. \n\nI understand that resistance is measured in Ohms, and that a resistance less than one ohm will yield a high current. I'd there more to it than that? Is \"futile\" some kind of term that I haven't learned?\n\nI just feel like I'm missing something.\n\nEdit: downvote me because I thought the joke had more to it. K. \n\nI guess the joke is just lame."}, {"replies": [], "body": "We're going to need more cards."}], "body": "It's not a Star Trek shirt,  it's an electronics joke. \n"}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "In that case I have never met this man in my life, nor have I been within 1000 paces of him."}], "body": "It's socially binding"}, {"replies": [], "body": "That's a yes."}, {"replies": [], "body": "Don't worry this is the internet, nobody gets judged on the internet."}], "body": "Is my answer legally binding ?"}], "body": "Do you want to bang this kid?"}], "body": "Ha, how could a shirt like that not work! It would totally work on me. "}], "body": "He should put his name and number on the cards and do that \"mic drop\" in front of a group of girls...you know..in case the Star Trek shirt doesn't work."}, {"replies": [{"replies": [], "body": "Putting two spaces at the end of a line will start a new line!  \nLike this :D"}], "body": "\"It's time to d-d-d-d-d-d-d-d-duel!\"       *flips cards*      \n*I shit myself, cry as I pull out my deck\"*"}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "Old enough to fuck your mom and give you a baby brother."}], "body": "You could ask him: /u/TheMattgican how old are you bud? "}], "body": "I would have thought he is 16-18"}], "body": "He looks like he is 18 or older. You make him sound like he is between 7 to 10. "}], "body": "The practice that went into this must have been immense.\n\nHats off to the kid. I had the attention span of a gold fish when I was that age."}, {"replies": [{"replies": [{"replies": [], "body": "You mean *the* **Mother Fucking HYPE MAN**"}], "body": "He wouldn't be old enough but yeah, totally looks like the thin one that stood in back."}, {"replies": [], "body": "Came here to say the same, glad I'm not alone!"}, {"replies": [], "body": "Went to college with the older crazy frog brother. I see some similarity, but this kid isn't nearly as lanky. "}], "body": "Is it just me, or does he look like one of the two \"crazy frog\" singing kids? "}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "I believe not being a bundle of sticks was one of OP's resolutions. Stick to it buddy!"}], "body": "Look at good guy OP over here. "}], "body": "[Here ya go](http://www.computergear.com/resisfuttshi.html?Size=Large&gclid=Cj0KEQiAqqO0BRDyo8mkv9y259EBEiQApVQD_bkUk1xOC9Y5qb69fBdNg2XnS0pWgTYKhizkEiqlYLAaAiCX8P8HAQ) "}], "body": "Where's the source for that shirt?"}], "body": "Source: https://www.instagram.com/p/-Mt8XRuiWD/\n\nEDIT: Youtube channel plug: https://www.youtube.com/watch?v=riHsyeGSG9s"}, {"replies": [], "body": "Gambit "}, {"replies": [], "body": "http://imgur.com/KY7XSiT\n\nGAH, why is he staring into my soul?!\n\nEdit: because stupid"}, {"replies": [{"replies": [], "body": "[GIFV Link](https://i.imgur.com/cfvsYr2.gifv)\n\n^^^[This ^^^image ^^^uses ^^^108651.04% ^^^less ^^^bandwidth!]"}], "body": "http://i.imgur.com/cfvsYr2.gif"}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "There is a difference between being *A* nerdy pussy and just being \"nerdy pussy\"."}], "body": "Can confirm: Am a nerdy pussy."}, {"replies": [], "body": "Usually it's crazy.  There is a large overlap in that Venn diagram. "}], "body": "Sometimes its the best."}], "body": "Nerdy pussy is still pussy!"}], "body": "You'd be surprised how popular these guys are in their nerdy crews. "}], "body": "I have my doubts."}, {"replies": [{"replies": [{"replies": [], "body": "That's not how it works. :(\n\n[What's wrong with a kiss boy?](https://www.youtube.com/watch?v=PqI-28meTZ8)"}], "body": "Either way, if he slammed that with the confidence that he snatched cards out of the air, they'll come back for more.  Eventually it would lead to a Pavlovian stimulus response, to where when he put on the serious face she would automatically get wet."}], "body": "Hopefully he would maintain that dead face the entire time.\n\nIt's like he's trying really hard to hold back a laugh or smile and over compensates with a super serious face."}, {"replies": [], "body": "http://i.imgur.com/eJu40w1.jpg"}], "body": "This guy fucks."}, {"replies": [], "body": "Haha, that smile was adorable! Hes like \"Woo, nailed it!\""}, {"replies": [], "body": "Actually practice is the key here. "}, {"replies": [], "body": "It's all about eye contact! "}, {"replies": [], "body": "10/10 would befriend"}, {"replies": [], "body": "Isn't this the same kid that had a dance off and owned it?\n\nhttps://www.youtube.com/watch?v=IAamdFA1gEo\n\n"}, {"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [{"replies": [], "body": "Now that's terrifying "}, {"replies": [], "body": "Except the dick."}], "body": "In every direction"}], "body": "the average redditor is probably 5 times that kids size. "}], "body": "[deleted]"}, {"replies": [], "body": "Hey man, direct eye contact is pretty scary. /s"}], "body": "Yeah, Reddit really plays into the \"always online, never outside\" stereotype sometimes, this kid is in no way intimidating."}, {"replies": [], "body": "The noobs put too many points in INT."}], "body": "Y'all have weak ass constitutions. \n  \n"}, {"replies": [], "body": "That's what concentrating looks like. And trying really hard to keep looking at the camera."}], "body": "I seriously was uneasy until that laugh. Those were some dead eyes up until the laugh."}], "body": "The laugh took him from psycho killer to possible normal person"}, {"replies": [], "body": "This is Reddit, judging others to make us feel better is important, don't ruin that. "}], "body": "The video ends with him laughing at himself. "}, {"replies": [{"replies": [{"replies": [], "body": "Oh hey, look at this guy. We can't all be intelligent idiots."}], "body": "I'll bet you look like a stupid idiot."}, {"replies": [], "body": "No, on reddit we are all suave, tall and socially apt. A young man playing a part for a short video must be judged remorselessly."}], "body": "Not making fun of how someone looks would also be nice. "}, {"replies": [], "body": "He kinda looks like a grown up version of [this kid](http://i.imgur.com/2RXSG.gif) "}], "body": "Not looking like a psycho would be nice, too."}, {"replies": [], "body": "The smile at the end :)"}, {"replies": [], "body": "The smile is the icing on the cake. Also, what does it say about me that a few seconds in, I started noticing the t-shirt and thinking that I need to get one like this (or this exact one, don't care if used)."}, {"replies": [], "body": "Holy shit, is this the same guy who danced in a red shirt to the crazy frog song 10 years ago? You know which video I'm talking about"}, {"replies": [], "body": "Just blink, guy!"}]